---
kind: type
id: T:Autodesk.Revit.DB.DocumentSetIterator
source: html/2e2e5e41-1e46-5c79-8524-a71660bdbef7.htm
---
# Autodesk.Revit.DB.DocumentSetIterator

An iterator to a set of documents.

## Syntax (C#)
```csharp
public abstract class DocumentSetIterator : APIObject,
	IEnumerator
```